; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v11 ?v6)
             (pred_4 ?v8 ?v13)
             (pred_2 ?v11 ?v13)
             (pred_6 ?v9 ?v11 )
	     (pred_10 ?v11)
             (pred_5 ?v2)
             (pred_12 ?v8)
             (pred_7 ?v13)
             (pred_8 ?v11)
             (pred_9 ?v8)
             (pred_1 ?v11)
             (pred_3 ))



(:action op_4
:parameters (?v3 ?v12 ?v7 ?v4)
:precondition (and (pred_5 ?v3) (pred_5 ?v12) (pred_12 ?v7) (pred_7 ?v4)
          (pred_11 ?v3 ?v12) (pred_4 ?v7 ?v4)
                   (pred_2 ?v12 ?v4) (pred_10 ?v3) 
                   (pred_8 ?v12) (pred_9 ?v7))
:effect (and  (pred_1 ?v12) (not (pred_8 ?v12))))


(:action op_3
:parameters (?v3 ?v5)
:precondition (and (pred_5 ?v3) (pred_5 ?v5)
               (pred_10 ?v3) (pred_11 ?v3 ?v5) (pred_1 ?v5))
:effect (and (pred_10 ?v5) (not (pred_10 ?v3))))

(:action op_5
:parameters (?v3 ?v7)
:precondition (and (pred_5 ?v3) (pred_12 ?v7) 
                  (pred_10 ?v3) (pred_6 ?v7 ?v3) (pred_3 ))
:effect (and (pred_9 ?v7)
   (not (pred_6 ?v7 ?v3)) (not (pred_3 ))))


(:action op_1
:parameters (?v3 ?v10 ?v1)
:precondition (and (pred_5 ?v3) (pred_12 ?v10) (pred_12 ?v1)
                  (pred_10 ?v3) (pred_9 ?v1) (pred_6 ?v10 ?v3))
:effect (and (pred_9 ?v10) (pred_6 ?v1 ?v3)
        (not (pred_9 ?v1)) (not (pred_6 ?v10 ?v3))))

(:action op_2
:parameters (?v3 ?v7)
:precondition (and (pred_5 ?v3) (pred_12 ?v7) 
                  (pred_10 ?v3) (pred_9 ?v7))
:effect (and (pred_3 ) (pred_6 ?v7 ?v3) (not (pred_9 ?v7)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_03 obj_24 obj_30 obj_02 obj_32 obj_11 obj_08 obj_12 obj_15 obj_19 obj_26 obj_18 obj_21 obj_29 obj_22 obj_01 obj_07 obj_28 obj_23 obj_17 obj_09 obj_10 obj_31 obj_04 obj_16
    obj_06 obj_25 obj_13
    obj_27 obj_14 obj_05 obj_20
    )

    (:init
       (pred_3)

       (pred_5 obj_03)
       (pred_5 obj_24)
       (pred_5 obj_30)
       (pred_5 obj_02)
       (pred_5 obj_32)
       (pred_5 obj_11)
       (pred_5 obj_08)
       (pred_5 obj_12)
       (pred_5 obj_15)
       (pred_5 obj_19)
       (pred_5 obj_26)
       (pred_5 obj_18)
       (pred_5 obj_21)
       (pred_5 obj_29)
       (pred_5 obj_22)
       (pred_5 obj_01)
       (pred_5 obj_07)
       (pred_5 obj_28)
       (pred_5 obj_23)
       (pred_5 obj_17)
       (pred_5 obj_09)
       (pred_5 obj_10)
       (pred_5 obj_31)
       (pred_5 obj_04)
       (pred_5 obj_16)
       (pred_7 obj_06)
       (pred_7 obj_25)
       (pred_7 obj_13)
       (pred_12 obj_27)
       (pred_12 obj_14)
       (pred_12 obj_05)
       (pred_12 obj_20)

       (pred_11 obj_03 obj_11)
       (pred_11 obj_03 obj_24)
       (pred_11 obj_24 obj_08)
       (pred_11 obj_24 obj_30)
       (pred_11 obj_24 obj_03)
       (pred_11 obj_30 obj_12)
       (pred_11 obj_30 obj_02)
       (pred_11 obj_30 obj_24)
       (pred_11 obj_02 obj_15)
       (pred_11 obj_02 obj_32)
       (pred_11 obj_02 obj_30)
       (pred_11 obj_32 obj_19)
       (pred_11 obj_32 obj_02)
       (pred_11 obj_11 obj_26)
       (pred_11 obj_11 obj_08)
       (pred_11 obj_11 obj_03)
       (pred_11 obj_08 obj_18)
       (pred_11 obj_08 obj_12)
       (pred_11 obj_08 obj_24)
       (pred_11 obj_08 obj_11)
       (pred_11 obj_12 obj_21)
       (pred_11 obj_12 obj_15)
       (pred_11 obj_12 obj_30)
       (pred_11 obj_12 obj_08)
       (pred_11 obj_15 obj_29)
       (pred_11 obj_15 obj_19)
       (pred_11 obj_15 obj_02)
       (pred_11 obj_15 obj_12)
       (pred_11 obj_19 obj_22)
       (pred_11 obj_19 obj_32)
       (pred_11 obj_19 obj_15)
       (pred_11 obj_26 obj_01)
       (pred_11 obj_26 obj_18)
       (pred_11 obj_26 obj_11)
       (pred_11 obj_18 obj_07)
       (pred_11 obj_18 obj_21)
       (pred_11 obj_18 obj_08)
       (pred_11 obj_18 obj_26)
       (pred_11 obj_21 obj_28)
       (pred_11 obj_21 obj_29)
       (pred_11 obj_21 obj_12)
       (pred_11 obj_21 obj_18)
       (pred_11 obj_29 obj_23)
       (pred_11 obj_29 obj_22)
       (pred_11 obj_29 obj_15)
       (pred_11 obj_29 obj_21)
       (pred_11 obj_22 obj_17)
       (pred_11 obj_22 obj_19)
       (pred_11 obj_22 obj_29)
       (pred_11 obj_01 obj_09)
       (pred_11 obj_01 obj_07)
       (pred_11 obj_01 obj_26)
       (pred_11 obj_07 obj_10)
       (pred_11 obj_07 obj_28)
       (pred_11 obj_07 obj_18)
       (pred_11 obj_07 obj_01)
       (pred_11 obj_28 obj_31)
       (pred_11 obj_28 obj_23)
       (pred_11 obj_28 obj_21)
       (pred_11 obj_28 obj_07)
       (pred_11 obj_23 obj_04)
       (pred_11 obj_23 obj_17)
       (pred_11 obj_23 obj_29)
       (pred_11 obj_23 obj_28)
       (pred_11 obj_17 obj_16)
       (pred_11 obj_17 obj_22)
       (pred_11 obj_17 obj_23)
       (pred_11 obj_09 obj_10)
       (pred_11 obj_09 obj_01)
       (pred_11 obj_10 obj_31)
       (pred_11 obj_10 obj_07)
       (pred_11 obj_10 obj_09)
       (pred_11 obj_31 obj_04)
       (pred_11 obj_31 obj_28)
       (pred_11 obj_31 obj_10)
       (pred_11 obj_04 obj_16)
       (pred_11 obj_04 obj_23)
       (pred_11 obj_04 obj_31)
       (pred_11 obj_16 obj_17)
       (pred_11 obj_16 obj_04)
       (pred_8 obj_07)
       (pred_8 obj_01)
       (pred_8 obj_09)
       (pred_8 obj_02)
       (pred_2  obj_07 obj_06)
       (pred_2  obj_01 obj_25)
       (pred_2  obj_09 obj_13)
       (pred_2  obj_02 obj_06)
       (pred_1 obj_03)
       (pred_1 obj_24)
       (pred_1 obj_30)
       (pred_1 obj_32)
       (pred_1 obj_11)
       (pred_1 obj_08)
       (pred_1 obj_12)
       (pred_1 obj_15)
       (pred_1 obj_19)
       (pred_1 obj_26)
       (pred_1 obj_18)
       (pred_1 obj_21)
       (pred_1 obj_29)
       (pred_1 obj_22)
       (pred_1 obj_28)
       (pred_1 obj_23)
       (pred_1 obj_17)
       (pred_1 obj_10)
       (pred_1 obj_31)
       (pred_1 obj_04)
       (pred_1 obj_16)

       (pred_4  obj_27 obj_06)
       (pred_4  obj_14 obj_25)
       (pred_4  obj_05 obj_13)
       (pred_4  obj_20 obj_25)
       (pred_6 obj_27 obj_23)
       (pred_6 obj_14 obj_31)
       (pred_6 obj_05 obj_31)
       (pred_6 obj_20 obj_09)
       (pred_10 obj_12)
    )

    (:goal (and
       (pred_6 obj_27 obj_10)
       (pred_6 obj_14 obj_29)
    ))
(:constraints
  (always (not (pred_10 obj_28)))
)
)

; plan
1. (op_3 obj_12 obj_21)
   deleted: (pred_10 obj_12)
   added: (pred_10 obj_21)
   goals met: 0 of 2
2. (op_3 obj_21 obj_29)
   deleted: (pred_10 obj_21)
   added: (pred_10 obj_29)
   goals met: 0 of 2
3. (op_3 obj_29 obj_23)
   deleted: (pred_10 obj_29)
   added: (pred_10 obj_23)
   goals met: 0 of 2
4. (op_5 obj_23 obj_27)
   deleted: (pred_6 obj_27 obj_23) (pred_3)
   added: (pred_9 obj_27)
   goals met: 0 of 2
5. (op_3 obj_23 obj_04)
   deleted: (pred_10 obj_23)
   added: (pred_10 obj_04)
   goals met: 0 of 2
6. (op_3 obj_04 obj_31)
   deleted: (pred_10 obj_04)
   added: (pred_10 obj_31)
   goals met: 0 of 2
7. (op_3 obj_31 obj_10)
   deleted: (pred_10 obj_31)
   added: (pred_10 obj_10)
   goals met: 0 of 2
8. (op_2 obj_10 obj_27)
   deleted: (pred_9 obj_27)
   added: (pred_3) (pred_6 obj_27 obj_10)
   goals met: 1 of 2
9. (op_3 obj_10 obj_31)
   deleted: (pred_10 obj_10)
   added: (pred_10 obj_31)
   goals met: 1 of 2
10. (op_5 obj_31 obj_14)
   deleted: (pred_6 obj_14 obj_31) (pred_3)
   added: (pred_9 obj_14)
   goals met: 1 of 2
11. (op_3 obj_31 obj_04)
   deleted: (pred_10 obj_31)
   added: (pred_10 obj_04)
   goals met: 1 of 2
12. (op_3 obj_04 obj_23)
   deleted: (pred_10 obj_04)
   added: (pred_10 obj_23)
   goals met: 1 of 2
13. (op_3 obj_23 obj_29)
   deleted: (pred_10 obj_23)
   added: (pred_10 obj_29)
   goals met: 1 of 2
14. (op_2 obj_29 obj_14)
   deleted: (pred_9 obj_14)
   added: (pred_3) (pred_6 obj_14 obj_29)
   goals met: 2 of 2
